; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v5)
		(pred_2 ?v7)
		(pred_4 ?v2)
		(pred_6 ?v2)
		(pred_5 ?v7 ?v2)
		(pred_1)
		(pred_3 ?v7))

   (:action op_2
       :parameters  (?v1 ?v8)
       :precondition (and (not-eq ?v1 ?v8) 
                          (pred_4 ?v1) (pred_4 ?v8) (pred_6 ?v1))
       :effect (and  (pred_6 ?v8)
		     (not (pred_6 ?v1))))


   (:action op_1
       :parameters (?v4 ?v3)
       :precondition  (and  (pred_2 ?v4) (pred_4 ?v3)
			    (pred_5 ?v4 ?v3) (pred_6 ?v3) (pred_1))
       :effect (and (pred_3 ?v4)
		    (not (pred_5 ?v4 ?v3)) 
		    (not (pred_1))))

   (:action op_3
       :parameters  (?v4  ?v3)
       :precondition  (and  (pred_2 ?v4) (pred_4 ?v3)
			    (pred_3 ?v4) (pred_6 ?v3))
       :effect (and (pred_5 ?v4 ?v3)
		    (pred_1)
		    (not (pred_3 ?v4)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_04 obj_06 obj_02 
          obj_05 obj_01 obj_03 
)
(:init
(pred_4 obj_04)
(pred_4 obj_06)
(pred_4 obj_02)
(pred_2 obj_05)
(pred_2 obj_01)
(pred_2 obj_03)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(pred_1)
(pred_5 obj_05 obj_06)
(pred_5 obj_01 obj_06)
(pred_5 obj_03 obj_06)
(pred_6 obj_04)
)
(:goal
(and
(pred_5 obj_05 obj_04)
(pred_5 obj_01 obj_04)
(pred_5 obj_03 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_05 obj_04) (pred_6 obj_02))
    (sometime-before  (pred_5 obj_01 obj_04) (pred_6 obj_02))
  )
)
)

; plan
1. (op_2 obj_04 obj_06)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_06)
   goals met: 1 of 3
2. (op_1 obj_01 obj_06)
   deleted: (pred_5 obj_01 obj_06) (pred_1)
   added: (pred_3 obj_01)
   goals met: 1 of 3
3. (op_2 obj_06 obj_02)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_02)
   goals met: 1 of 3
4. (op_3 obj_01 obj_02)
   deleted: (pred_3 obj_01)
   added: (pred_5 obj_01 obj_02) (pred_1)
   goals met: 1 of 3
5. (op_2 obj_02 obj_06)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_06)
   goals met: 1 of 3
6. (op_1 obj_05 obj_06)
   deleted: (pred_5 obj_05 obj_06) (pred_1)
   added: (pred_3 obj_05)
   goals met: 1 of 3
7. (op_2 obj_06 obj_04)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_04)
   goals met: 1 of 3
8. (op_3 obj_05 obj_04)
   deleted: (pred_3 obj_05)
   added: (pred_5 obj_05 obj_04) (pred_1)
   goals met: 2 of 3
9. (op_2 obj_04 obj_02)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_02)
   goals met: 2 of 3
10. (op_1 obj_01 obj_02)
   deleted: (pred_5 obj_01 obj_02) (pred_1)
   added: (pred_3 obj_01)
   goals met: 2 of 3
11. (op_2 obj_02 obj_04)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_04)
   goals met: 2 of 3
12. (op_3 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_5 obj_01 obj_04) (pred_1)
   goals met: 3 of 3
